app/controllers/scheduler_controller.rb

SELECT * FROM "robots"
SELECT * FROM "floors"
SELECT * FROM "movementfroms"
SELECT * FROM "movementtos"
SELECT * FROM "frequencies"
---
  def new
    if request.get?
      @schedulers = Array.new(3) {Scheduler.new}
      @robots = Robot.all
      @floors = Floor.all
      @movements_from = Movementfrom.all
      @movements_to = Movementto.all
      @freq = Frequency.all